"OK" = "OK";
"Back" = "Back";
"Done" = "Done";
"Close" = "Close";
"Sorry" = "Sorry";
"Cancel" = "Cancel";
"Setting" = "Setting";
"Photos" = "Photos";
"Videos" = "Videos";
"Preview" = "Preview";
"Full image" = "Full image";
"Processing..." = "Processing...";
"Synchronizing photos from iCloud" = "Synchronizing photos from iCloud";
"Can not use camera" = "Can not use camera";
"Can not choose both video and photo" = "Can not choose both video and photo";
"Can not choose both photo and GIF" = "Can not choose both photo and GIF";
"Select the video when in multi state, we will handle the video as a photo" = "Select the video when in multi state, we will handle the video as a photo";
"Can not jump to the privacy settings page, please go to the settings page by self, thank you" = "Can not jump to the privacy settings page, please go to the settings page by self, thank you";

"Select a maximum of %zd photos" = "Select a maximum of %zd photos";
"Select a minimum of %zd photos" = "Select a minimum of %zd photos";
"Allow %@ to access your album in \"Settings -> Privacy -> Photos\"" = "Allow %@ to access your album in \"Settings -> Privacy -> Photos\"";
"Please allow %@ to access your camera in \"Settings -> Privacy -> Camera\"" = "Please allow %@ to access your camera in \"Settings -> Privacy -> Camera\"";

"Apply" = "Apply";
"Reject" = "Reject";
"Allow" = "Allow";
"Not Allow" = "Not Allow";

"Use your calendar" = "Use your calendar";

"Obtain your location info" = "Obtain your location info";
"Obtain your profile photo" = "Obtain your profile photo";
"Access and save pictures or videos on device" = "Access and save pictures or videos on device";
"Use your camera" = "Use your camera";
"Use your microphone" = "Use your microphone";
"Use your bluetooth" = "Use your bluetooth";
"Use your addressBook" = "Use your addressBook";
"Obtain your phoneNumber" = "Obtain your phoneNumber";
"Obtain your userProfile" = "Obtain your userProfile";

"Selected for %ld seconds" = "Selected for %ld seconds";
"Allow %@ to access your all photos" = "%@ can only access selected photos. Allow access \"All Photos\"";
"Add more accessible photos" = "Add more \n accessible photos";
"Edit" = "Edit";

"Loading failed, please try again later" = "Loading failed, please try again later";

"Forward To" = "Forward To";
"Settings" = "Settings";
"Feedback" = "Feedback";
"Restart" = "Restart";
"Open Debug" = "Open Debug";
"Close Debug" = "Close Debug";
"Share" = "Share";
"Wechat" = "Wechat";
"Add Favorite" = "Add Favorite";
"Cancel Favorite" = "Cancel Favorite";
"Add To Desktop" = "Add To Desktop";

"Add Favorite Success" = "Add Favorite Success";
"Add Favorite Failure" = "Add Favorite Failure";
"Cancel Favorite Success" = "Cancel Favorite Success";
"Cancel Favorite Failure" = "Cancel Favorite Failure";
"Add To Desktop Failure" = "Add To Desktop Failure";

"%@ Authorizations History" = "%@ Authorizations History";
"No access history of My Information & Authorizations." = "No access history of My Information & Authorizations.";
"No %@" = "No %@";

"Allow \"%@\" to use" = "Allow \"%@\" to use";

"\"%@\"does not use any permissions" = "\"%@\"does not use any permissions";

"Search for location" = "Search for location";
"Location" = "Location";
"Don't show location" = "Don't show location";
"Search nearby" = "Search nearby";
"Office Building" = "Office Building";

"User info" = "User info";
"Location info" = "Location info";
"Background Location info" = "Background Location info";
"Mobile address book" = "Mobile address book";
"Microphone" = "Microphone";
"Camera" = "Camera";
"Album" = "Album";
"Calendar" = "Calendar";
"Buletooth" = "Buletooth";
"QR Code" = "QR Code";
"License Plate" = "License Plate";
"Phone" = "Phone";

"About" = "About";
"Basic Info" = "Basic Info";
"Account" = "Account";
"Desc" = "Desc";
"Version" = "Version";
"Notes" = "Notes";
"Labels" = "Labels";
"Global Privacy Statement" = "Global Privacy Statement";
"statement and" = " and ";
"The developer of this Mini-App confirm that it has not processed any information of the user in any way. If there is any subsequent handling of user information, Mini-App Privacy Guidelines will be updated in a timely manner. If you find that the developer has mishandled your privacy information, you may click here to take a issue." = "The developer of this Mini-App confirm that it has not processed any information of the user in any way. If there is any subsequent handling of user information, Mini-App Privacy Guidelines will be updated in a timely manner. If you find that the developer has mishandled your privacy information, you may click here to take a issue.";
"Statement of Service" = "Statement of Service";
"Developers handle your personal information in strict accordance with %@ Privacy Guidelines, and you may take a issue if  you find that a developer has mishandled your private information." = "Developers handle your personal information in strict accordance with %@ , and you may %@ if  you find that a developer has mishandled your private information.";
"The Mini-App is provided to you by the developer, who assumes full responsibility for the authenticity, legality and validity of the information content, data material and its operation of this service." = "The Mini-App is provided to you by the developer, who assumes full responsibility for the authenticity, legality and validity of the information content, data material and its operation of this service.";
"Instruction" = "About Third-Party Access to User Info";
"Privacy Guidelines" = " %@ Mini Program Privacy Policy";
"Custom Privacy Guidelines" = " %@ ";
"take a issue" = "report";
"App disable feedback function" = "App disable feedback function";
"Customize Privacy Statement" = "Upon your authorization, the %@ developers (including %@ developers on behalf of development services and developers of embedded plugins in %@) will %@ to provide services for you. The developer shall process your personal information in strict accordance with %@. In the event of the developer's improper use of your personal information, please %@ to us.";
"Default Privacy Statement" = "Upon your authorization, the %@ developers (including %@ developers on behalf of development services and developers of embedded plugins in %@) will %@ to provide services for you. The developer shall process your personal information in strict accordance with network security law and personal information protection norms and other relevant laws and regulations when collecting, storing, processing or using user privacy and data. In the event of the developer's improper use of your personal information, please %@ to us.";
" and %@ others"=" and %@ others";

" and %@ others"=" and %@ others";

"Recents" = "Recents";
"Save Image" = "Save Image";
"Save Video" = "Save Video";
"Save" = "Save";

"Effective after reopening" = "Effective after reopening";

"Failed to get the picture" = "Failed to get the picture";
"This device does not have an album" = "This device does not have an album";
"Failed to process image" = "Failed to process image";
"No QR code/barcode found" = "No QR code/barcode found";
"No QR code found" = "No QR code found";
"No barcode found" = "No barcode found";
"No Data Matrix code found" = "No Data Matrix code found";
"No pdf417 code found" = "No pdf417 code found";
"Only QR codes are supported below iOS 11" = "Only QR codes are supported below iOS 11";
"Please tap to continue" = "Please tap to continue";

// page title
"Not Found" = "Not Found";
"Not Registered" = "Not Registered";
"In The Blacklist" = "In The Blacklist";

// title
"Unable to open the page" = "Unable to open the page";
"Unable to open this page" = "Unable to open this page";

// FATErrorCodeUnknown 9999
"No %@ found in service" = "No %@ found in service";
// FATErrorCodeAppKeyInvalid 10000
"SDK not initialized or App Key is illegal" = "SDK not initialized or App Key is illegal";
"[%@]parameter missing" = "[%@]parameter missing";
"[%@]App Key is invalid" = "[%@]App Key is invalid";
"[%@]bundleID is not match appKey" = "[%@]bundleID is not match appKey";
// FATErrorCodeInvalidParam 10001
"Parameter is illegal" = "Parameter is illegal";

"Request parameter is illegal" = "Request parameter is illegal";
"parentVC is illegal" = "parentVC is illegal";
"appId is not configured" = "appId is not configured";

"SDK Key is not allowed to open offline %@" = "SDK Key is not allowed to open offline %@";
"Packages is not configured" = "Packages is not configured";

"%@ information is empty" = "%@ information is empty";
"%@ information encrypted is empty" = "%@ information encrypted is empty";
"%@ data type error" = "%@ data type error";
"%@ type is missing" = "%@ type is missing";
"Unkown %@ type" = "Unkown %@ type";
"CodeId is invalid" = "CodeId is invalid";
"%@ ID is invalid" = "%@ ID is invalid";
"QR Code form is illegal" = "QR Code form is illegal";

"Device type is not supported" = "Device type is not supported";
"The number of available devices has reached its maximum" = "The number of available devices has reached its maximum";

"The page does not exist. Please contact the developer" = "The page does not exist. Please contact the developer";

// FATErrorCodeDomainInvalid 10002
"ENV verification failed" = "ENV verification failed";
"%@ domain not initialized" = "%@ domain not initialized";
"License domain is invalid" = "License domain is invalid";
"Service is not initialized" = "Service is not initialized";
"The domain %@ is not registered. Please give feedback to developer by taking a functionality issue." = "The domain %@ is not registered. Please give feedback to developer by taking a functionality issue.";
"The domain %@ has been blacklisted" = "The domain %@ has been blacklisted by the operation and cannot open the current page. Please contact the developer to provide feedback.";

// FATErrorCodeNetworkNotReach 10003
"Please confirm your network and reopen %@" = "Please confirm your network and reopen %@";
"The Internet connection appears to be offline." = "The Internet connection appears to be offline.";
"The request timed out." = "The request timed out.";

// FATErrorCodeRequestFail 11000
"Network request failed" = "Network request failed";
"Request failed" = "Request failed";
"%@ request failed" = "%@ request failed";
"Foundation library request failed" = "Foundation library request failed";
"Batch %@ request failed" = "Batch %@ request failed";
"DV request failed" = "DV request failed";

// FATErrorCodeResponseDataInvalid 11001
"Foudation library response error" = "Foudation library response error";
"Foudation library response decrypted error" = "Foudation library response decrypted error";
"%@ response error" = "%@ response error";
"%@ response decrypt error" = "%@ response decrypt error";
"response error" = "response error";
"response decrypt error" = "response decrypt error";
"%@ service error, please retry" = "%@ service error, please retry";
"Batch %@ response error" = "Batch %@ response error";

// FATErrorCodeDownloadURLInvalid 11002
"Download address error" = "Download address error";
"Download address of %@ error, downloading failed" = "Download address of %@ error, downloading failed";
"AppId is empty, downloading failed" = "AppId is empty, downloading failed";
"Downloaded address of foundation library error, downloading failed" = "Downloaded address of foundation library error, downloading failed";

// FATErrorCodeDownloadDirectoryError 11003
"Extract directory cannot be empty" = "Extract directory cannot be empty";
"Downloading directory error" = "Downloading directory error";
"Document name error" = "Document name error";
"Document name of foundation library error" = "Document name of foundation library error";
"Storage directory error" = "Storage directory error";

// FATErrorCodeDownloadFail 11004
"Server error, downloading failed" = "Server error, downloading failed";

// FATErrorCodeResponseDataUnchanged 11005
"Service error, Foundation Library detail API response with empty data" = "Service error, Foundation Library detail API response with empty data";
"Service error, %@ detail API response with empty data" = "Service error, %@ detail API response with empty data";
"Service error, API response with empty data" = "Service error, API response with empty data";

// FATErrorCodeZipInvalid 12000
"MD5 file is invalid" = "MD5 file is invalid";
"Unzip file failed" = "Unzip file failed";

"Unzip %@ package failed" = "Unzip %@ package failed";
"Copy %@ package failed" = "Copy %@ package failed";
"%@ package is missing" = "%@ package is missing";

"Unzip foudation library failed" = "Unzip foudation library failed";

"%@ offline pacakge is missing" = "%@ offline pacakge is missing";

"Foudation library offline package is missing" = "Foudation library offline package is missing";
"Unzip foudation library offline package failed" = "Unzip foudation library offline package failed";

// FATErrorCodeCopyResourceFail 12001
"Copy resources to running directory failed" = "Copy resources to running directory failed";
"%@ subpackage resources not found" = "%@ subpackage resources not found";

// FATErrorCodeServiceNotFound 12002
"Service.html is missing, please confirm pakcage is compiled" = "Service.html is missing, please confirm pakcage is compiled";

// FATErrorCodeNotTrialAccess 13000
"Failed to obtain trial version" = "Failed to obtain trial version";
"No trial access." = "No trial access";
"No trial access. Please contact the administrator." = "No trial access. Please contact the administrator.";
"No access. Please contact the administrator." = "No access. Please contact the administrator.";

// FATErrorCodeTrialCanceled 13001
"Preview edition is cancelled" = "Preview edition is cancelled";
"Preview edition is cancelled, please confirm Preview Edition is configured" = "Preview edition is cancelled, please confirm Preview Edition is configured";

// FATErrorCodeTempExpried 13002
"QR code is expired" = "QR code is expired";

// FATErrorCodeSameAppID 13003
"APP ID is duplicate" = "APP ID is duplicate";

// FATErrorCodeNotExamineAccess 13005
"No examine access." = "No examine access.";

// FATErrorCodeNotDevelopAccess 13006
"No develop access." = "No develop access.";

// FATErrorCodeAppletNotFound 14000
"%@ not found with appId" = "%@ not found with appId";

// FATErrorCodeForegroundAppletNotFound 14001
"%@ not found that is running" = "%@ not found that is running";

// FATErrorCodeAppletConsoleNotReady 14002
"console is not ready" = "console is not ready";

// Requset API
"FS_APP_ID_NOT_FOUND_T" = "Failed to open Mini-App";
"FS_APP_ID_NOT_FOUND_M" = "Mini-App not found. Please check your App ID";

"FS_APP_IS_FORBIDDEN_T" = "Mini-App not available";
"FS_APP_IS_FORBIDDEN_M" = "Mini-App is disabled";

"FS_APP_NOT_ASS_BIND_T" = "Mini-App not available";
"FS_APP_NOT_ASS_BIND_M" = "Mini-app and Host App are unbounded. Please verify your mini-app is associated with a registered host app.";

"FS_APP_PAY_EXPIRE_T" = "Mini-App not available";
"FS_APP_PAY_EXPIRE_M" = "Mini-App is expired";

"FS_APP_SEQUENCE_NOT_FOUND_T" = "Failed to open Mini-App";
"FS_APP_SEQUENCE_NOT_FOUND_M" = "Mini-app version not found.";

"FS_BIND_IS_FORBIDDEN_T" = "Mini-App not available";
"FS_BIND_IS_FORBIDDEN_M" = "Your host app bundle ID is invalid.";

"FS_BIND_NOT_FOUND_T" = "Service not available";
"FS_BIND_NOT_FOUND_M" = "Host App is not registered with the platform.";

"FS_BIND_PAY_EXPIRE_T" = "Mini-App not available";
"FS_BIND_PAY_EXPIRE_M" = "Host app  has expired.";

"FS_COOPERATION_TERMINATED_T" = "Mini-App not available";
"FS_COOPERATION_TERMINATED_M" = "Host App is not associated with current Mini-App";

"FS_DB_ERR_T" = "Service not available";
"FS_DB_ERR_M" = "database error";

"FS_GET_DOMAIN_INFO_ERROR_T" = "Service not available";
"FS_GET_DOMAIN_INFO_ERROR_M" = "Unsuccessful domain name resolution";

"FS_GET_GROUP_FAILED_T" = "Service not available";
"FS_GET_GROUP_FAILED_M" = "Organization status verification exception";

"FS_LICENSE_INVALID_ERR_T" = "Mini-App not available";
"FS_LICENSE_INVALID_ERR_M" = "license exception";

"FS_ORGAN_STATUS_INVALID_T" = "Mini-App not available";
"FS_ORGAN_STATUS_INVALID_M" = "Organization account is frozen. Please verify your account in platform";

"FS_SERVICE_UNAVAILABLE_T" = "Mini-App not available";
"FS_SERVICE_UNAVAILABLE_M" = "Mini-App is removed";

"FS_SIGNATURE_SDKKEY_INVAILD_T" = "Mini-App not available";
"FS_SIGNATURE_SDKKEY_INVAILD_M" = "SDK key invalid. Please contact your administrator";

"FS_SYSTEM_CALL_T" = "Service not available";
"FS_SYSTEM_CALL_M" = "system  error";

"OVER_FRQ_LIMIT_T" = "Service not available";
"OVER_FRQ_LIMIT_M" = "Your subscription service has reached its limit. Please consider to upgrade your service capacity";

"FS_QR_CODE_EXPIRED_T" = "QR code is expired";

"FS_NOT_TRIAL_INFO_T" = "Preview edition is cancelled";
"FS_NOT_TRIAL_INFO_M" = "Preview edition is cancelled, please confirm Preview Edition is configured";

"FC_TRIAL_USERID_NO_MATCH_T" = "No trial access";
"FC_TRIAL_USERID_NO_MATCH_M" = "No trial access. Please contact the administrator.";

"FC_RULE_TRIAL_USERID_NO_MATCH_T" = "No trial access";
"FC_RULE_TRIAL_USERID_NO_MATCH_M" = "No trial access. Please contact the administrator.";

"FC_DEV_USERID_NO_MATCH_T" = "No develop access";
"FC_DEV_USERID_NO_MATCH_M" = "No access. Please contact the administrator.";

"FS_ADMIN_AUTH_ERR_T" = "No examine access";
"FS_ADMIN_AUTH_ERR_M" = "No access. Please contact the administrator.";

"Apple Maps" = "Apple Maps";
"Baidu Maps" = "Baidu Maps";
"Amap" = "Amap";
"Google Maps" = "Google Maps";
"Tencent Maps" = "Tencent Maps";
"Navigate to" = "Navigate to";

"While Using the Mini-App" = "While Using the Mini-App";
"While Using the Mini-App and After Leaving" = "While Using the Mini-App and After Leaving";

"Allow While Using the Mini-App" = "Allow While Using the Mini-App";
"Allow While Using the Mini-App and After Leaving" = "Allow While Using the Mini-App and After Leaving";

"Confirm exit the Mini-App" = "Confirm exit the Mini-App";
"Remote debugging parameter is illegal" = "Remote debugging parameter is illegal";
"Remote debugging connection disconnected" = "Remote debugging connection disconnected";
"Remote debugging connection failed. Please check the network and try again" = "Remote debugging connection failed. Please check the network and try again";

"Reminder" = "Reminder";
"The first %d files selected are valid" = "The first %d files selected are valid";

// toast
"apiServer number exceeds license limit" = "apiServer number exceeds license limit";

"loading"="loading";
"sdk configuration information is empty"="sdk configuration information is empty";

"Locating"="Locating";
"Using microphone"="Using microphone";
//picker
"picker_year"="";//这里就是空
"picker_day"="";//这里就是空
"picker_month_1"="Jan";
"picker_month_2"="Feb";
"picker_month_3"="Mar";
"picker_month_4"="Apr";
"picker_month_5"="May";
"picker_month_6"="Jun";
"picker_month_7"="Jul";
"picker_month_8"="Aug";
"picker_month_9"="Sep";
"picker_month_10"="Oct";
"picker_month_11"="Nov";
"picker_month_12"="Dec";

//game keyboard
"keyboard_done"="done";
"keyboard_next"="next";
"keyboard_search"="search";
"keyboard_go"="go";
"keyboard_send"="send";
